# BuiltInFailures.FaceSplitterFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FaceSplitterFailures Class
BuiltInFailures Class Members See Also
---
Failures about FaceSplitter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class FaceSplitterFailures
```

Visual Basic
---
```text
Public NotInheritable Class FaceSplitterFailures
```

Visual C++
---
```text
public ref class FaceSplitterFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..FaceSplitterFailures
# See Also
BuiltInFailures..::..FaceSplitterFailures Members
Autodesk.Revit.DB Namespace